# **Pandas**

Pandas is a Python library that makes working with data tables (like Excel spreadsheets) super easy.

In [30]:
# Importing the pandas so that we can use it 

import pandas as pd

# Best practice: set display options for better readability
pd.set_option('display.max_columns', None)

## Two types of data in pandas

**1. *Series***
  -  A Series is a single column of data - like one column in an Excel spreadsheet.
  - A Series is a **one-dimensional** labeled array that can hold any data type (integers, strings, floats, etc.).

In [3]:
# Example

series = pd.Series(["BMW", "Toyota", "Honda"])

In [4]:
print(series)
type(series)

0       BMW
1    Toyota
2     Honda
dtype: object

pandas.core.series.Series

In [5]:
# series = 1-dimensional

In [6]:
colours = pd.Series(["Red", "Blue", "White"])
colours

0      Red
1     Blue
2    White
dtype: object

**Series can take:**

- ✅ List (most common)
- ✅ Dictionary
- ✅ NumPy array
- ✅ Single values

---

**2. **DataFrame****
- A DataFrame is a table with multiple columns - like a complete Excel spreadsheet.
- A DataFrame is a two-dimensional labeled data structure with rows and columns.
- Each column in a DataFrame is actually a Series!

In [7]:
car_data = pd.DataFrame({"car make" : series, "colour" : colours})
car_data

  car make colour
0      BMW    Red
1   Toyota   Blue
2    Honda  White

***DataFrame can take:***

- ✅ Dictionary (most common) - keys become column names
- ✅ List of lists
- ✅ List of dictionaries
- ✅ NumPy array
- ✅ Another DataFrame
- ✅ CSV/Excel files

---

In [8]:
# Import data

car_sales = pd.read_csv("car-sales.csv")

In [9]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

![](../assets\images\pandas-anatomy-of-a-dataframe.png)

In [10]:
# Exporting a Dataframe


car_sales.to_csv("exported-car-sales.csv", index = False)
# can use .to_excel to expot in excel
# index = False means that no need give number to the rows

In [11]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [12]:
# export from URL

heart_disease = pd.read_csv("https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/heart-disease.csv")

In [13]:
heart_disease

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

---

## Key Takeaways

✅ **Series** = 1D (single column)  
✅ **DataFrame** = 2D (multiple columns)  
✅ Use `pd.read_csv()` to import data  
✅ Use `.to_csv()` to export data  
✅ Always explore data with `.head()`, `.info()`, `.describe()`

---

## **Describe data**

In [ ]:
# Attribute
# Check data types
car_sales.dtypes

# Fucntion 
# car_sales.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [15]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [16]:
car_coloumns = car_sales.columns
car_coloumns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [17]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [18]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [ ]:
# Shows statistical summary of numerical columns only.
car_sales.describe()

# count - How many non-null values
# mean - Average value
# std - Standard deviation (spread of data)
# min - Minimum value
# 25% - 25th percentile (Q1)
# 50% - Median (middle value)
# 75% - 75th percentile (Q3)
# max - Maximum value

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [ ]:
# Check data types
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [ ]:
# Average Values for numbers only 
car_sales.mean(numeric_only=True)

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [25]:
car_prices = pd.Series([3000, 1500, 111250])
car_prices.mean()

np.float64(38583.333333333336)

In [26]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [27]:
car_sales["Doors"].sum()

np.int64(40)

In [28]:
len(car_sales)

10

In [34]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [35]:
#  Get a basic shape info

print(f"Shape : {car_sales.shape}")  # (rows, columns)

Shape : (10, 5)

# **Viewing and selecting data**

In [ ]:
# Shows the first 5 rows by default of a Database
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [37]:
car_sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [38]:
#  Shows the last 5 rows by default of a database
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [39]:
car_sales.tail(7)

     Make Colour  Odometer (KM)  Doors       Price
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# `loc` and `iloc` - Select Data by Label vs Position 🎯

These are the two main ways to access specific rows and columns in a DataFrame.

1. `iloc` - Integer Location (Position-based)
- What it does: Select by row/column INDEX NUMBER (position).

2. `loc` - Label (Name-based)
- What it does: Select by column NAME or `index` LABEL.

In [42]:
animals = pd.Series(["cat", "dog", "bird", "panda", "tiger"],
                    index=["a", "b", "c", "d", "e"])

In [43]:
animals

a      cat
b      dog
c     bird
d    panda
e    tiger
dtype: object

In [ ]:
# .loc
animals.loc["a"]

'cat'

In [45]:
animals.loc["e"]

'tiger'

In [46]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [47]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [53]:
# .iloc
# positon 
animals.iloc[3]

'panda'

In [54]:
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [55]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [57]:
animals

a      cat
b      dog
c     bird
d    panda
e    tiger
dtype: object

In [56]:
# using slicing 

animals.iloc[:3]

a     cat
b     dog
c    bird
dtype: object

In [59]:
car_sales.loc[:3]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [60]:
car_sales.head(4)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [ ]:
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [ ]:

car_sales.Make

# They both do the same thing

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [ ]:

car_sales.Make

# They both do the same thing 
# Caution: if the coloumn name has a space in between then it wont work

In [69]:
car_sales["Odometer (KM)"]
# car_sales.Odometer (KM) -> Will throw error

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [62]:
car_sales["Colour"]

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [70]:
car_sales[car_sales["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

### Boolean Filtering

```text
Original DataFrame:          Boolean mask:           Result:
Make  | Price                Make == "Toyota"        Make  | Price
------+-------               --------+----            ------+-------
BMW   | 5000                 False                    Toyota| 3000
Toyota| 3000        ----->   True         ----->     Toyota| 2500
Honda | 4000                 False
Toyota| 2500                 True
```

In [76]:
# Step 1: Create the temporary column
condition = car_sales["Make"] == "Toyota"
print("TEMPORARY COLUMN:")
print(condition)
# Output:
# 0     False
# 1      True   ← Temporary!
# 2     False
# 3      True   ← Temporary!

# Step 2: Use it to filter (temporary column disappears)
result = car_sales[condition]
print("\nFINAL RESULT (temporary column gone):")
print(result)
# Output: Only the rows where condition was True
# Make    | Price
# Toyota  | 3000
# Toyota  | 2500

TEMPORARY COLUMN:
0     True
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8     True
9    False
Name: Make, dtype: bool

FINAL RESULT (temporary column gone):
     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [77]:
car_sales[car_sales["Odometer (KM)"] > 100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00